# Введення кількості метрів
meters = float(input("Введіть кількість метрів: "))

# Вибір одиниці вимірювання
print("Виберіть одиницю вимірювання:")
print("Милі")
print("Дюйми")
print("Ярди")
unit = input("Введіть одиницю вимірювання: ")

# Перетворення метрів у вибрану одиницю вимірювання
if unit == "Милі":
    miles = meters / 1609.344
    print("Кількість миль:", miles)
elif unit == "Дюйми":
    inches = meters * 39.3701
    print("Кількість дюймів:", inches)
elif unit == "Ярди":
    yards = meters / 0.9144
    print("Кількість ярдів:", yards)
else:
    print("Неправильний вибір одиниці вимірювання")
